Tekla Open API Reference for Tekla Structures 2025
Distance.ToDecimalString Method
 Converts the distance to a decimal string representation.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToDecimalString()
Public Function ToDecimalString As String
Return Value
Type: String
The string representation of the distance.
Examples
 This example shows how to convert a Distance instance into a decimal string.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           string formattedString = distance.ToDecimalString();
       }
}
See Also
Reference
Distance Structure
ToDecimalString Overload
Tekla.Structures.Datatype Namespace